nrfconnect/sdk-nrf/drivers/wifi/nrf71/src/fmac_main.c
	if (!vif_ctx_zep) {
		LOG_ERR("%s: vif_ctx_zep is NULL", __func__);
		return;
	}

	rpu_ctx_zep = vif_ctx_zep->rpu_ctx_zep;
	fmac_dev_ctx = rpu_ctx_zep->rpu_ctx;

	LOG_DBG("%s: cookie_rsp_event->cookie = %llx", __func__, cookie_rsp_event->cookie);
	LOG_DBG("%s: host_cookie = %llx", __func__, cookie_rsp_event->host_cookie);
	LOG_DBG("%s: mac_addr = %x:%x:%x:%x:%x:%x", __func__,
		cookie_rsp_event->mac_addr[0],
		cookie_rsp_event->mac_addr[1],
		cookie_rsp_event->mac_addr[2],
		cookie_rsp_event->mac_addr[3],
		cookie_rsp_event->mac_addr[4],
		cookie_rsp_event->mac_addr[5]);

	vif_ctx_zep->cookie_resp_received = true;
	/* TODO: When supp_callbk_fns.mgmt_tx_status is implemented, add logic
	 * here to use the cookie and host_cookie to map requests to responses.
	 */
	if (vif_ctx_zep->supp_drv_if_ctx &&
		vif_ctx_zep->supp_callbk_fns.cookie_event) {
		vif_ctx_zep->supp_callbk_fns.cookie_event(vif_ctx_zep->supp_drv_if_ctx,
			cookie_rsp_event->host_cookie, cookie_rsp_event->cookie);
		}
}
#endif /* CONFIG_NRF71_STA_MODE */

void reg_change_callbk_fn(void *vif_ctx,
			  struct nrf_wifi_event_regulatory_change *reg_change_event,
			  unsigned int event_len)
{
	struct nrf_wifi_vif_ctx_zep *vif_ctx_zep = NULL;
	struct nrf_wifi_ctx_zep *rpu_ctx_zep = NULL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	LOG_DBG("%s: Regulatory change event received", __func__);

	vif_ctx_zep = vif_ctx;

	if (!vif_ctx_zep) {
		LOG_ERR("%s: vif_ctx_zep is NULL", __func__);
		return;
	}

	rpu_ctx_zep = vif_ctx_zep->rpu_ctx_zep;
	if (!rpu_ctx_zep) {
		LOG_ERR("%s: rpu_ctx_zep is NULL", __func__);
		return;
	}

	fmac_dev_ctx = rpu_ctx_zep->rpu_ctx;
	if (!fmac_dev_ctx) {
		LOG_ERR("%s: fmac_dev_ctx is NULL", __func__);
		return;
	}

	if (!fmac_dev_ctx->waiting_for_reg_event) {
		LOG_DBG("%s: Unsolicited regulatory change event", __func__);
		/* TODO: Handle unsolicited regulatory change event */
		return;
	}

	fmac_dev_ctx->reg_change = nrf_wifi_osal_mem_alloc(sizeof(struct
							   nrf_wifi_event_regulatory_change));
	if (!fmac_dev_ctx->reg_change) {
		LOG_ERR("%s: Failed to allocate memory for reg_change", __func__);
		return;
	}

	memcpy(fmac_dev_ctx->reg_change,
		   reg_change_event,
		   sizeof(struct nrf_wifi_event_regulatory_change));
	fmac_dev_ctx->reg_set_status = true;
}
#endif /* !CONFIG_NRF71_RADIO_TEST */


/**
 * @brief Get operating band bitmap from Kconfig (see NRF_WIFI_OP_BAND_* in
 * nrf71_wifi_ctrl.h / nrf71_wifi_common.h).
 *
 * @return Bitmap of bands (NRF_WIFI_OP_BAND_2GHZ, NRF_WIFI_OP_BAND_5GHZ,
 *         NRF_WIFI_OP_BAND_6GHZ).
 */
static unsigned char get_nrf_wifi_op_band(void)
{
	if (IS_ENABLED(CONFIG_NRF_WIFI_2G_BAND)) {
		return NRF_WIFI_OP_BAND_2GHZ;
	}
	if (IS_ENABLED(CONFIG_NRF_WIFI_5G_BAND)) {
		return NRF_WIFI_OP_BAND_5GHZ;
	}
	if (IS_ENABLED(CONFIG_NRF_WIFI_6G_BAND)) {
		return NRF_WIFI_OP_BAND_6GHZ;
	}
	if (IS_ENABLED(CONFIG_NRF_WIFI_DUAL_BAND)) {
		return NRF_WIFI_OP_BAND_2GHZ | NRF_WIFI_OP_BAND_5GHZ;
	}
	return NRF_WIFI_OP_BAND_2GHZ | NRF_WIFI_OP_BAND_5GHZ | NRF_WIFI_OP_BAND_6GHZ;
}

#ifndef CONFIG_NRF71_RADIO_TEST
struct rf_hex_param {
	const char *hex_str;
	uint8_t *bytes;
	int bytes_len;
};

static struct rf_hex_param rf_params[NUM_WIFI_PARAMS] = {
	{NRF_WIFI_PARAMS1, NULL, 0},  {NRF_WIFI_PARAMS2, NULL, 0},  {NRF_WIFI_PARAMS3, NULL, 0},
	{NRF_WIFI_PARAMS4, NULL, 0},  {NRF_WIFI_PARAMS5, NULL, 0},  {NRF_WIFI_PARAMS6, NULL, 0},
	{NRF_WIFI_PARAMS7, NULL, 0},  {NRF_WIFI_PARAMS8, NULL, 0},  {NRF_WIFI_PARAMS9, NULL, 0},
	{NRF_WIFI_PARAMS10, NULL, 0}, {NRF_WIFI_PARAMS11, NULL, 0}, {NRF_WIFI_PARAMS12, NULL, 0},
	{NRF_WIFI_PARAMS13, NULL, 0}, {NRF_WIFI_PARAMS14, NULL, 0}, {NRF_WIFI_PARAMS15, NULL, 0},
	{NRF_WIFI_PARAMS16, NULL, 0}, {NRF_WIFI_PARAMS17, NULL, 0}, {NRF_WIFI_PARAMS18, NULL, 0},
	{NRF_WIFI_PARAMS19, NULL, 0}, {NRF_WIFI_PARAMS20, NULL, 0}, {NRF_WIFI_PARAMS21, NULL, 0},
	{NRF_WIFI_PARAMS22, NULL, 0},
};

enum nrf_wifi_status nrf_wifi_fmac_config_rf_params(void *dev_ctx, unsigned int *rf_params_addr)
{
	int index;
	int cleanup_idx;
	size_t str_len;
	int ret;

	for (index = 0; index < NUM_WIFI_PARAMS; index++) {
		if (!rf_params[index].hex_str) {
			continue;
		}
		str_len = strlen(rf_params[index].hex_str);
		rf_params[index].bytes = k_malloc(str_len);
		if (!rf_params[index].bytes) {
			LOG_ERR("%s: Unable to allocate %zu bytes", __func__, str_len);
			goto cleanup;
		}

		ret = nrf_wifi_utils_hex_str_to_val(rf_params[index].bytes, (unsigned int)str_len,
						    (unsigned char *)rf_params[index].hex_str);
		if (ret < 0) {
			LOG_ERR("%s: hex_str_to_val failed", __func__);
			k_free(rf_params[index].bytes);
			rf_params[index].bytes = NULL;
			goto cleanup;
		}

		rf_params[index].bytes_len = ret;
		rf_params_addr[index] = (unsigned int)rf_params[index].bytes;
	}
	return NRF_WIFI_STATUS_SUCCESS;

cleanup:
	for (cleanup_idx = 0; cleanup_idx < index; cleanup_idx++) {
		if (rf_params[cleanup_idx].bytes) {
			k_free(rf_params[cleanup_idx].bytes);
			rf_params[cleanup_idx].bytes = NULL;
		}
	}
	return NRF_WIFI_STATUS_FAIL;
}

struct nrf_wifi_vtf_params_host {
	unsigned int voltage;
	unsigned int temp;
	unsigned int x0_freq;
};

enum nrf_wifi_status nrf_wifi_fmac_config_vtf_params(struct nrf_wifi_fmac_dev_ctx *dev_ctx,
						     unsigned int voltage, unsigned int temp,
						     unsigned int x0,
						     unsigned int *vtf_buffer_start_address)
{
	struct nrf_wifi_vtf_params_host *vtf_buf;

	if (!vtf_buffer_start_address) {
		return NRF_WIFI_STATUS_FAIL;
	}

	vtf_buf = k_malloc(sizeof(*vtf_buf));
	if (!vtf_buf) {
		LOG_ERR("%s: k_malloc failed for VTF params", __func__);
		return NRF_WIFI_STATUS_FAIL;
	}

	vtf_buf->voltage = voltage;
	vtf_buf->temp = temp;
	vtf_buf->x0_freq = x0;
	*vtf_buffer_start_address = (unsigned int)vtf_buf;
	return NRF_WIFI_STATUS_SUCCESS;
}
#endif /* CONFIG_NRF71_RADIO_TEST */

enum nrf_wifi_status nrf_wifi_fmac_dev_add_zep(struct nrf_wifi_drv_priv_zep *drv_priv_zep)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_ctx_zep *rpu_ctx_zep = NULL;
	void *rpu_ctx = NULL;
	unsigned char op_band = get_nrf_wifi_op_band();
#ifdef CONFIG_NRF_WIFI_LOW_POWER
	int sleep_type = -1;

