nrfconnect/sdk-nrf/drivers/wifi/nrf71/src/fmac_main.c
#ifndef CONFIG_NRF71_RADIO_TEST
	sleep_type = HW_SLEEP_ENABLE;
#else
	sleep_type = SLEEP_DISABLE;
#endif /* CONFIG_NRF71_RADIO_TEST */
#endif /* CONFIG_NRF_WIFI_LOW_POWER */
	struct nrf_wifi_tx_pwr_ctrl_params tx_pwr_ctrl_params;
	struct nrf_wifi_tx_pwr_ceil_params tx_pwr_ceil_params;
	struct nrf_wifi_board_params board_params;
	unsigned int fw_ver = 0;

#if defined(CONFIG_NRF71_SR_COEX_SLEEP_CTRL_GPIO_CTRL) && \
	defined(CONFIG_NRF71_SYSTEM_MODE)
	unsigned int alt_swctrl1_function_bt_coex_status1 =
			(~CONFIG_NRF71_SR_COEX_SWCTRL1_OUTPUT) & 0x1;
	unsigned int invert_bt_coex_grant_output = CONFIG_NRF71_SR_COEX_BT_GRANT_ACTIVE_LOW;
#endif /* CONFIG_NRF71_SR_COEX_SLEEP_CTRL_GPIO_CTRL && CONFIG_NRF71_SYSTEM_MODE */

	rpu_ctx_zep = &drv_priv_zep->rpu_ctx_zep;

	rpu_ctx_zep->drv_priv_zep = drv_priv_zep;

#ifdef CONFIG_NRF71_RADIO_TEST
	rpu_ctx = nrf_wifi_rt_fmac_dev_add(drv_priv_zep->fmac_priv, rpu_ctx_zep);
#else
	rpu_ctx = nrf_wifi_sys_fmac_dev_add(drv_priv_zep->fmac_priv, rpu_ctx_zep);
#endif /* CONFIG_NRF71_RADIO_TEST */

	if (!rpu_ctx) {
		LOG_ERR("%s: nrf_wifi_fmac_dev_add failed", __func__);
		rpu_ctx_zep = NULL;
		goto err;
	}

	rpu_ctx_zep->rpu_ctx = rpu_ctx;

	status = nrf_wifi_fmac_ver_get(rpu_ctx,
				       &fw_ver);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: FW version read failed", __func__);
		goto err;
	}

	LOG_DBG("Firmware (v%d.%d.%d.%d) booted successfully",
		NRF_WIFI_UMAC_VER(fw_ver),
		NRF_WIFI_UMAC_VER_MAJ(fw_ver),
		NRF_WIFI_UMAC_VER_MIN(fw_ver),
		NRF_WIFI_UMAC_VER_EXTRA(fw_ver));


#if defined(CONFIG_NRF71_SR_COEX_SLEEP_CTRL_GPIO_CTRL) && \
	defined(CONFIG_NRF71_SYSTEM_MODE)
	LOG_DBG("Configuring SLEEP CTRL GPIO control register\n");
	status = nrf_wifi_coex_config_sleep_ctrl_gpio_ctrl(rpu_ctx_zep->rpu_ctx,
			alt_swctrl1_function_bt_coex_status1,
			invert_bt_coex_grant_output);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: Failed to configure GPIO control register", __func__);
		goto err;
	}
#endif /* CONFIG_NRF71_SR_COEX_SLEEP_CTRL_GPIO_CTRL  && CONFIG_NRF71_SYSTEM_MODE */

	status = nrf_wifi_fmac_config_rf_params(rpu_ctx_zep->rpu_ctx,
						rpu_ctx_zep->phy_rf_params_addr);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: Failed to configure RF params", __func__);
		goto err;
	}

	/* TODO: Remove hardcodes once we hook in sensor readings */
	status = nrf_wifi_fmac_config_vtf_params(rpu_ctx_zep->rpu_ctx, 243, 25, 0,
						 &rpu_ctx_zep->vtf_buffer_start_address);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: Failed to configure VTF params", __func__);
		goto err;
	}

#ifdef CONFIG_NRF71_RADIO_TEST
	status = nrf_wifi_rt_fmac_dev_init(rpu_ctx_zep->rpu_ctx,
#ifdef CONFIG_NRF_WIFI_LOW_POWER
					sleep_type,
#endif /* CONFIG_NRF_WIFI_LOW_POWER */
					NRF_WIFI_DEF_PHY_CALIB,
					op_band,
					IS_ENABLED(CONFIG_NRF_WIFI_BEAMFORMING),
					&tx_pwr_ctrl_params,
					&tx_pwr_ceil_params,
					&board_params,
					STRINGIFY(CONFIG_NRF71_REG_DOMAIN));
#else
	status = nrf_wifi_sys_fmac_dev_init(
		rpu_ctx_zep->rpu_ctx,
#ifdef CONFIG_NRF_WIFI_LOW_POWER
		sleep_type,
#endif /* CONFIG_NRF_WIFI_LOW_POWER */
		NRF_WIFI_DEF_PHY_CALIB, op_band, IS_ENABLED(CONFIG_NRF_WIFI_BEAMFORMING),
		&tx_pwr_ctrl_params, &tx_pwr_ceil_params, &board_params,
		STRINGIFY(CONFIG_NRF71_REG_DOMAIN), rpu_ctx_zep->phy_rf_params_addr,
			  rpu_ctx_zep->vtf_buffer_start_address);
#endif /* CONFIG_NRF71_RADIO_TEST */


	if (status != NRF_WIFI_STATUS_SUCCESS) {
		LOG_ERR("%s: nrf_wifi_sys_fmac_dev_init failed", __func__);
		goto err;
	}

	return status;
err:
	if (rpu_ctx) {
		nrf_wifi_fmac_dev_rem(rpu_ctx);
		rpu_ctx_zep->rpu_ctx = NULL;
	}
	return status;
}

enum nrf_wifi_status nrf_wifi_fmac_dev_rem_zep(struct nrf_wifi_drv_priv_zep *drv_priv_zep)
{
	struct nrf_wifi_ctx_zep *rpu_ctx_zep = NULL;

	rpu_ctx_zep = &drv_priv_zep->rpu_ctx_zep;
#ifdef CONFIG_NRF71_RADIO_TEST
	nrf_wifi_rt_fmac_dev_deinit(rpu_ctx_zep->rpu_ctx);
#else
	nrf_wifi_sys_fmac_dev_deinit(rpu_ctx_zep->rpu_ctx);
#endif /* CONFIG_NRF71_RADIO_TEST */

	nrf_wifi_fmac_dev_rem(rpu_ctx_zep->rpu_ctx);

	for (int i = 0; i < NUM_RF_PARAM_ADDRS; i++) {
		k_free((void *)rpu_ctx_zep->phy_rf_params_addr[i]);
		rpu_ctx_zep->phy_rf_params_addr[i] = 0;
	}
	k_free((void *)rpu_ctx_zep->vtf_buffer_start_address);
	rpu_ctx_zep->vtf_buffer_start_address = 0;
	nrf_wifi_osal_mem_free(rpu_ctx_zep->extended_capa);
	rpu_ctx_zep->extended_capa = NULL;
	nrf_wifi_osal_mem_free(rpu_ctx_zep->extended_capa_mask);
	rpu_ctx_zep->extended_capa_mask = NULL;

	rpu_ctx_zep->rpu_ctx = NULL;
	LOG_DBG("%s: FMAC device removed", __func__);

	return NRF_WIFI_STATUS_SUCCESS;
}

static int nrf_wifi_drv_main_zep(const struct device *dev)
{
#ifndef CONFIG_NRF71_RADIO_TEST
	struct nrf_wifi_fmac_callbk_fns callbk_fns = { 0 };
	struct nrf_wifi_data_config_params data_config = { 0 };
	struct rx_buf_pool_params rx_buf_pools[MAX_NUM_OF_RX_QUEUES];
	struct nrf_wifi_vif_ctx_zep *vif_ctx_zep = dev->data;
	static unsigned char fixed_vif_cnt;

	if (fixed_vif_cnt >= MAX_NUM_VIFS) {
		LOG_ERR("%s: Max number of VIFs reached", __func__);
		return -ENOMEM;
	}

	/* Setup the linkage between the FMAC and the VIF contexts */
	vif_ctx_zep->rpu_ctx_zep = &rpu_drv_priv_zep.rpu_ctx_zep;
#ifndef CONFIG_NRF71_RADIO_TEST
	k_work_init_delayable(&vif_ctx_zep->scan_timeout_work,
			      nrf_wifi_scan_timeout_work);
	k_work_init(&vif_ctx_zep->disp_scan_res_work,
		    nrf_wifi_disp_scan_res_work_handler);

	vif_ctx_zep->bss_max_idle_period = USHRT_MAX;
#endif /* !CONFIG_NRF71_RADIO_TEST */

	if (fixed_vif_cnt++ > 0) {
		/* FMAC is already initialized for VIF-0 */
		return 0;
	}

#ifdef CONFIG_NRF71_DATA_TX
	data_config.aggregation = aggregation;
	data_config.wmm = IS_ENABLED(CONFIG_NRF_WIFI_FEAT_WMM);
	data_config.max_num_tx_agg_sessions = max_num_tx_agg_sessions;
	data_config.max_num_rx_agg_sessions = max_num_rx_agg_sessions;
	data_config.max_tx_aggregation = max_tx_aggregation;
	data_config.reorder_buf_size = reorder_buf_size;
	data_config.max_rxampdu_size = max_rxampdu_size;
	data_config.rate_protection_type = rate_protection_type;
	callbk_fns.if_carr_state_chg_callbk_fn = nrf_wifi_if_carr_state_chg;
	callbk_fns.rx_frm_callbk_fn = nrf_wifi_if_rx_frm;
#endif
#if defined(CONFIG_NRF71_RAW_DATA_RX) || defined(CONFIG_NRF71_PROMISC_DATA_RX)
	callbk_fns.sniffer_callbk_fn = nrf_wifi_if_sniffer_rx_frm;
#endif /* CONFIG_NRF71_RAW_DATA_RX || CONFIG_NRF71_PROMISC_DATA_RX */
	rx_buf_pools[0].num_bufs = rx1_num_bufs;
	rx_buf_pools[1].num_bufs = rx2_num_bufs;
	rx_buf_pools[2].num_bufs = rx3_num_bufs;
	rx_buf_pools[0].buf_sz = rx1_buf_sz;
	rx_buf_pools[1].buf_sz = rx2_buf_sz;
	rx_buf_pools[2].buf_sz = rx3_buf_sz;

#ifdef CONFIG_NRF_WIFI_RPU_RECOVERY
	callbk_fns.rpu_recovery_callbk_fn = nrf_wifi_rpu_recovery_cb;
#endif /* CONFIG_NRF_WIFI_RPU_RECOVERY */
	callbk_fns.scan_start_callbk_fn = nrf_wifi_event_proc_scan_start_zep;
	callbk_fns.scan_done_callbk_fn = nrf_wifi_event_proc_scan_done_zep;
	callbk_fns.reg_change_callbk_fn = reg_change_callbk_fn;
	callbk_fns.event_get_reg = nrf_wifi_event_get_reg_zep;
#ifdef CONFIG_WIFI_MGMT_RAW_SCAN_RESULTS
	callbk_fns.rx_bcn_prb_resp_callbk_fn = nrf_wifi_rx_bcn_prb_resp_frm;
#endif /* CONFIG_WIFI_MGMT_RAW_SCAN_RESULTS */
#ifdef CONFIG_NRF71_SYSTEM_MODE
	callbk_fns.set_if_callbk_fn = nrf_wifi_set_iface_event_handler;
#endif /* CONFIG_NRF71_SYSTEM_MODE */
#ifdef CONFIG_NRF71_STA_MODE
	callbk_fns.twt_config_callbk_fn = nrf_wifi_event_proc_twt_setup_zep;
	callbk_fns.twt_teardown_callbk_fn = nrf_wifi_event_proc_twt_teardown_zep;
	callbk_fns.twt_sleep_callbk_fn = nrf_wifi_event_proc_twt_sleep_zep;
	callbk_fns.event_get_ps_info = nrf_wifi_event_proc_get_power_save_info;
	callbk_fns.cookie_rsp_callbk_fn = nrf_wifi_event_proc_cookie_rsp;
	callbk_fns.process_rssi_from_rx = nrf_wifi_process_rssi_from_rx;
	callbk_fns.scan_res_callbk_fn = nrf_wifi_wpa_supp_event_proc_scan_res;
	callbk_fns.auth_resp_callbk_fn = nrf_wifi_wpa_supp_event_proc_auth_resp;
	callbk_fns.assoc_resp_callbk_fn = nrf_wifi_wpa_supp_event_proc_assoc_resp;
	callbk_fns.deauth_callbk_fn = nrf_wifi_wpa_supp_event_proc_deauth;
	callbk_fns.disassoc_callbk_fn = nrf_wifi_wpa_supp_event_proc_disassoc;
	callbk_fns.get_station_callbk_fn = nrf_wifi_wpa_supp_event_proc_get_sta;
	callbk_fns.get_interface_callbk_fn = nrf_wifi_wpa_supp_event_proc_get_if;
	callbk_fns.mgmt_tx_status = nrf_wifi_wpa_supp_event_mgmt_tx_status;
	callbk_fns.unprot_mlme_mgmt_rx_callbk_fn = nrf_wifi_wpa_supp_event_proc_unprot_mgmt;
	callbk_fns.event_get_wiphy = nrf_wifi_wpa_supp_event_get_wiphy;
	callbk_fns.mgmt_rx_callbk_fn = nrf_wifi_wpa_supp_event_mgmt_rx_callbk_fn;
	callbk_fns.get_conn_info_callbk_fn = nrf_wifi_supp_event_proc_get_conn_info;
	callbk_fns.roc_callbk_fn = nrf_wifi_supp_event_remain_on_channel;
	callbk_fns.roc_cancel_callbk_fn = nrf_wifi_supp_event_roc_cancel_complete;
#endif /* CONFIG_NRF71_STA_MODE */

